<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"cae194580d9f7234a07b4339861d3cbd55859a01f3e16fd3e954722c50d05f8d","plan_job_ref":"Job PR Plan #7 at https://github.com/tyng94/tyng94/actions/runs/6983252306","plan_hash":"c0a9b38667b75bd7588debf996d0fc4f28ce533f98dd32173155374bd454bbfc","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in ___infrastructure__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test will be created
  + resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tyio-test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #4](https://github.com/tyng94/tyng94/actions/runs/6983258012)